In [5]:
import pandas as pd

# Data Analytics Fundamentals - Topic 5

Reworking the lesson data using Python

In [6]:
df = pd.read_csv("data/bpp_topic_5_data/bpp5_joined_csv.csv")
df

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Value,pupils.Value,spend.Value
0,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,1999.0,19.23044,NaN,9096.0
1,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2000.0,19.05967,16.400000,9263.0
2,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2001.0,18.94779,NaN,9436.0
3,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2010.0,16.82253,32.080002,9231.0
4,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2002.0,19.06977,NaN,9840.0
...,...,...,...,...,...,...,...,...
8476,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2014.0,22.03949,NaN,NaN
8477,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2015.0,22.25553,NaN,NaN
8478,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2016.0,22.63736,NaN,NaN
8479,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2017.0,23.17948,NaN,NaN
8480,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2018.0,23.00915,NaN,NaN

In [7]:
df = df.dropna(subset=["Year"])
df

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Value,pupils.Value,spend.Value
0,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,1999.0,19.23044,NaN,9096.0
1,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2000.0,19.05967,16.400000,9263.0
2,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2001.0,18.94779,NaN,9436.0
3,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2010.0,16.82253,32.080002,9231.0
4,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2002.0,19.06977,NaN,9840.0
...,...,...,...,...,...,...,...,...
8476,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2014.0,22.03949,NaN,NaN
8477,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2015.0,22.25553,NaN,NaN
8478,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2016.0,22.63736,NaN,NaN
8479,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2017.0,23.17948,NaN,NaN
8480,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2018.0,23.00915,NaN,NaN

In [8]:
df = df.dropna(subset=["Value", "pupils.Value", "spend.Value"], how="all")
df

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Value,pupils.Value,spend.Value
0,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,1999.0,19.23044,NaN,9096.0
1,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2000.0,19.05967,16.400000,9263.0
2,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2001.0,18.94779,NaN,9436.0
3,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2010.0,16.82253,32.080002,9231.0
4,Aruba,ABW,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2002.0,19.06977,NaN,9840.0
...,...,...,...,...,...,...,...,...
8476,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2014.0,22.03949,NaN,NaN
8477,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2015.0,22.25553,NaN,NaN
8478,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2016.0,22.63736,NaN,NaN
8479,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2017.0,23.17948,NaN,NaN
8480,"Middle East, North Africa, Afghanistan & Pakis...",TMN,"Pupil-teacher ratio, primary",SE.PRM.ENRL.TC.ZS,2018.0,23.00915,NaN,NaN